## Staging: system_status_static_site
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**❌ &nbsp; Conftest:** `failed` 

```terraform
Plan: 11 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                  NAME                                                                   |
|--------|-----------------------------------------------------------------------------------------------------------------------------------------|
| add    | `module.system_status_static_site.aws_acm_certificate.cloudfront[0]`                                                                    |
|        | `module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0]`                                                         |
|        | `module.system_status_static_site.aws_cloudfront_distribution.simple_static_website`                                                    |
|        | `module.system_status_static_site.aws_cloudfront_origin_access_identity.simple_static_website`                                          |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_alias`                                                                  |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;*.status.staging.notification.cdssandbox.xyz&quot;]` |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;status.staging.notification.cdssandbox.xyz&quot;]`   |
|        | `module.system_status_static_site.aws_s3_bucket.this`                                                                                   |
|        | `module.system_status_static_site.aws_s3_bucket_policy.oai_policy`                                                                      |
|        | `module.system_status_static_site.aws_s3_bucket_website_configuration.this`                                                             |
|        | `module.system_status_static_site.random_string.suffix`                                                                                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.system_status_static_site.data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system_status_static_site.aws_acm_certificate.cloudfront[0] will be created
  + resource "aws_acm_certificate" "cloudfront" {
      + arn                       = (known after apply)
      + domain_name               = "status.staging.notification.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.status.staging.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "status.staging.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.status.staging.notification.cdssandbox.xyz",
          + "status.staging.notification.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0] will be created
  + resource "aws_acm_certificate_validation" "cloudfront" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.system_status_static_site.aws_cloudfront_distribution.simple_static_website will be created
  + resource "aws_cloudfront_distribution" "simple_static_website" {
      + aliases                         = [
          + "status.staging.notification.cdssandbox.xyz",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "simple_static_website"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "simple_static_website"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.system_status_static_site.aws_cloudfront_origin_access_identity.simple_static_website will be created
  + resource "aws_cloudfront_origin_access_identity" "simple_static_website" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Allow CloudFront to reach the S3 bucket for domain status.staging.notification.cdssandbox.xyz"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_alias will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "status.staging.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["*.status.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cloudfront_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["status.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cloudfront_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.system_status_static_site.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "notification-canada-ca-staging-system-status"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.system_status_static_site.aws_s3_bucket_policy.oai_policy will be created
  + resource "aws_s3_bucket_policy" "oai_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.system_status_static_site.aws_s3_bucket_website_configuration.this will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.system_status_static_site.random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + system_status_static_site_bucket_id     = (known after apply)
  + system_status_static_site_bucket_name   = (known after apply)
  + system_status_static_site_bucket_region = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.system_status_static_site.aws_s3_bucket.this"]
FAIL - plan.json - main - Policy document has invalid effect: ["module.system_status_static_site.data.aws_iam_policy_document.s3_policy"]

20 tests, 18 passed, 1 warning, 1 failure, 0 exceptions

```

</details>
